Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: `@Transactional(NOT_SUPPORTED)`: if a transaction was started, suspends it and works with no transaction for the boundary of the method ; otherwise works with no transaction.
pt_br: `@Transactional(NOT_SUPPORTED)`: Se uma transação foi iniciada, suspende-a e trabalha sem transação durante o limite do método; caso contrário, trabalha sem transação.

source: `@Transactional(REQUIRED)` (default): starts a transaction if none was started, stays with the existing one otherwise.
pt_br: '@Transactional(REQUIRED)' (padrão): inicia uma transação se nenhuma foi iniciada, permanece com a existente caso contrário.

source: `@Transactional(REQUIRES_NEW)`: starts a transaction if none was started ; if an existing one was started, suspends it and starts a new one for the boundary of that method.
pt_br: «@Transactional(REQUIRES_NEW)»: inicia uma transação se não tiver sido iniciada nenhuma; se um existente foi iniciado, suspende-o e inicia um novo para o limite desse método.

source: `@Transactional(SUPPORTS)`: if a transaction was started, joins it ; otherwise works with no transaction.
pt_br: `@Transactional(SUPPORTS)`: se foi iniciada uma transação, junta-se a ela; caso contrário, não funciona com nenhuma transação.

source: `CompletionStage` (from the JDK)
pt_br: `CompletionStage` (do JDK)

source: `IdentityProvider` converts the authentication credentials provided by `HttpAuthenticationMechanism` to a `SecurityIdentity` instance.
pt_br: `IdentityProvider` converte as credenciais de autenticação fornecidas por `HttpAuthenticationMechanism` para uma instância `SecurityIdentity`.

source: `TieredCompilation` can also be interesting for regular Lambda functions.
pt_br: `TieredCompilation` também pode ser interessante para funções Lambda regulares.

source: `api-only` only starts a Kubernetes API Server. If you need a fully-featured Kubernetes cluster that can spin up Pods, you can use `k3s` or `kind`. Note that they both requires to run in Docker privileged mode.
pt_br: 'api-only' inicia apenas um Servidor de API Kubernetes. Se você precisa de um cluster Kubernetes totalmente funcional que possa criar Pods, você pode usar k3s ou kind. Observe que ambos requerem que sejam executados em modo privilegiado do Docker."

source: `function.zip` - lambda deployment file
pt_br: `function.zip` - arquivo de deployment lambda

source: `quarkus.amqp.devservices.enabled` is set to `false`
pt_br: `quarkus.amqp.devservices.enabled` é definido como `false`

source: `quarkus.container-image.build=true` instructs Quarkus to create a container-image using the final application artifact (which is the native executable in this case)
pt_br: `quarkus.container-image.build=true` instrui o Quarkus para criar um container-image utilizando o artefato final da aplicação (que, neste caso, é o executável nativo)

source: `quarkus.kafka.devservices.enabled` is set to `false`
pt_br: `quarkus.kafka.devservices.enabled` esteja definido como `false`

source: `quarkus.kubernetes-client.devservices.enabled` is set to `false`
pt_br: `quarkus.kubernetes-client.devservices.enabled` esteja definido como `false`

source: `quarkus.native.container-build=true` allows for creating a Linux executable without GraalVM being installed (and is only necessary if you don't have GraalVM installed locally or your local operating system is not Linux)
pt_br: `quarkus.native.container-build=true` permite criar um executável Linux sem que o GraalVM esteja instalado (e só é necessário se não tiver o GraalVM instalado localmente ou se o seu sistema operacional local não for Linux)

source: `quarkus.pulsar.devservices.enabled` is set to `false`
pt_br: `quarkus.pulsar.devservices.enabled` é definido como `false`

source: `sam.jvm.yaml` - sam cli deployment script
pt_br: `sam.jvm.yaml` - script de deployment do sam cli

source: `sam.native.yaml` - sam cli deployment script for native
pt_br: `sam.native.yaml` - script de deployment do sam cli para nativo

source: a valid Kube config file is found and `quarkus.kubernetes-client.devservices.override-kubeconfig` is not set to `true`
pt_br: Um arquivo de configuração Kube válido seja encontrado e `quarkus.kubernetes-client.devservices.override-kubeconfig` não está definido como `true`

source: all
pt_br: todos

source: all the Reactive Messaging AMQP channels have the `host` or `port` attributes set
pt_br: todos os canais AMQP de mensagens reativas tenham os atributos `host` ou `port` definidos

source: all the Reactive Messaging Kafka channels have the `bootstrap.servers` attribute set
pt_br: todos os canais Kafka de mensagens reativas tenham o atributo `bootstrap.servers` definido

source: all the Reactive Messaging Pulsar channels have the `serviceUrl` attribute set
pt_br: todos os canais Pulsar de mensagens reativas têm o atributo `serviceUrl` definido

source: allows plain-text communication as well as TLS, and TLS with mutual authentication
pt_br: permite comunicação em texto simples, bem como TLS, e TLS com autenticação mútua

source: command-line
pt_br: linha de comando

source: core
pt_br: núcleo

source: e.g.,
pt_br: por exemplo,

source: extensions can produce a list of classes (using the `io.quarkus.deployment.builditem.PreloadClassBuildItem` build item)
pt_br: as extensões podem produzir uma lista de classes (utilizando o item de compilação `io.quarkus.deployment.builditem.PreloadClassBuildItem` )

source: false
pt_br: falso

source: how to compile your application natively
pt_br: como compilar a sua aplicação nativamente

source: how to create and scaffold a new project
pt_br: como criar e pré-definir um novo projeto

source: how to deal with extensions
pt_br: como lidar com as extensões

source: how to develop your application in your IDE
pt_br: como desenvolver a sua aplicação no seu IDE

source: how to enable live reload
pt_br: como ativar o _live reload_

source: how to set up Quarkus tools in xref:ide-tooling.adoc[Visual Studio Code, Eclipse IDE, Eclipse Che and IntelliJ IDEA]
pt_br: como configurar as ferramentas Quarkus no link:ide-tooling.html[Visual Studio Code, Eclipse IDE, Eclipse Che e IntelliJ IDEA]

source: how to use the xref:cli-tooling.adoc[CLI] for your toolchain
pt_br: como utilizar o link:cli-tooling.html[CLI] para o seu conjunto de ferramentas

source: how to use xref:gradle-tooling.adoc[Gradle] as a build tool
pt_br: como utilizar link:gradle-tooling.html[o Gradle] como uma ferramenta de construção

source: how to use xref:maven-tooling.adoc[Maven] as a build tool
pt_br: como utilizar link:maven-tooling.html[o Maven] como ferramenta de construção

source: https://aws.amazon.com[An Amazon AWS account]
pt_br: link:https://aws.amazon.com[Uma conta Amazon AWS]

source: https://catalog.redhat.com/software/container-stacks/detail/5ec53f50ef29fd35586d9a56[Red Hat Universal Base Image 8]
pt_br: link:https://catalog.redhat.com/software/container-stacks/detail/5ec53f50ef29fd35586d9a56[Imagem Base Universal da Red Hat]

source: https://dl.acm.org/doi/10.1145/3583678.3596895[Considerations for integrating virtual threads in a Java framework: a Quarkus example in a resource-constrained environment]
pt_br: https://dl.acm.org/doi/10.1145/3583678.3596895[Considerações sobre a integração de threads virtuais num framework Java: um exemplo do Quarkus num ambiente com recursos limitados]

source: https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[AWS SAM CLI]
pt_br: link:https://docs.aws.amazon.com/serverless-application-model/latest/developerguide/serverless-sam-cli-install.html[CLI DO AWS SAM]

source: https://www.graalvm.org[GraalVM] is a universal virtual machine for running applications written in various different languages, as well as providing the ability to compile JVM bytecode to a native executable (this native executable runs a special virtual machine called SubstrateVM). These native executables start much faster and can use a lot less memory than a traditional JVM, however not every JVM feature is supported, and some are more limited than normal.
pt_br: https://www.graalvm.org[GraalVM] é uma máquina virtual universal para executar aplicações escritas em várias linguagens diferentes, além de fornecer a capacidade de compilar bytecode JVM para um executável nativo (este executável nativo executa uma máquina virtual especial chamada SubstrateVM). Esses executáveis nativos iniciam muito mais rápido e podem usar muito menos memória do que uma JVM tradicional, no entanto, nem todos os recursos da JVM são suportados, e alguns são mais limitados do que o normal.

source: https://www.redhat.com/en/blog/introducing-red-hat-universal-base-image[Introduction to Universal Base Image]
pt_br: link:https://www.redhat.com/en/blog/introducing-red-hat-universal-base-image[Introdução à imagem base universal]

source: image:containerization-process.png[Containerization Process]
pt_br: image:containerization-process.png[alt=Processo de conteinerização]

source: image:native-executable-process.png[Creating a native executable]
pt_br: image:native-executable-process.png[alt=Criando um executável nativo]

source: in the `gdb` prompt.
pt_br: no prompt `gdb`.

source: initialize the client in a `static` block, which, thanks to class preloading will be executed before the snapshot
pt_br: inicializar o client num bloco `static`, que, graças ao pré-carregamento da classe, será executado antes do snapshot

source: integrates with the reactive engine from Quarkus as well as the reactive development model
pt_br: integra-se com o motor reativo do Quarkus, bem como com o modelo de desenvolvimento reativo

source: jbang Integration
pt_br: integração jbang

source: lifecycle event
pt_br: evento do ciclo de vida

source: link:/container-first[Learn more].
pt_br: link:/container-first[Saiba mais].

source: link:/continuum[Learn more].
pt_br: link:/continuum[Saiba mais].

source: link:/developer-joy[Learn more].
pt_br: link:/developer-joy[Saiba mais].

source: link:/standards[Learn more].
pt_br: link:/standards[Saiba mais].

source: newsletter
pt_br: boletim informativo

source: register a CRaC Resource doing the initialization
pt_br: registar um recurso CRaC que efetua a inicialização

source: supports consuming gRPC services
pt_br: suporta o consumo de serviços gRPC

source: supports https://grpc.github.io/grpc-java/javadoc/io/grpc/inprocess/InProcessServerBuilder.html[InProcess] gRPC development
pt_br: suporta o desenvolvimento de gRPC link:https://grpc.github.io/grpc-java/javadoc/io/grpc/inprocess/InProcessServerBuilder.html[InProcess]

source: supports https://grpc.github.io/grpc/core/md_doc_grpc_xds_features.html[xDS gRPC] integration
pt_br: suporta a integração link:https://grpc.github.io/grpc/core/md_doc_grpc_xds_features.html[xDS gRPC]

source: supports implementing gRPC services
pt_br: suporta a implementação de serviços gRPC

source: the Redis key is built as follows: `cache:$cache-name:$cache-key`, where `cache-key` is the key the application uses.
pt_br: a chave Redis é construída da seguinte forma: `cache:$cache-name:$cache-key`, onde `cache-key` é a chave que a aplicação utiliza.

source: the `amqp-host` or `amqp-port` is configured
pt_br: o `amqp-host` ou `amqp-port` esteja configurado

source: the `api-server-url` is configured
pt_br: A URL `api-server-url` esteja configurada.

source: the `kafka.bootstrap.servers` is configured
pt_br: o `kafka.bootstrap.servers` esteja configurado

source: the `pulsar.client.serviceUrl` is configured
pt_br: o `pulsar.client.serviceUrl` está configurado

source: the first one uses the traditional blocking style, it is considered blocking due to its signature.
pt_br: o primeiro utiliza o estilo de bloqueio tradicional, que é considerado bloqueante devido à sua assinatura.

source: the second one uses Mutiny, it is considered non-blocking due to its signature.
pt_br: o segundo utiliza o Mutiny, que é considerado não bloqueante devido à sua assinatura.

source: the value is encoded to JSON if needed
pt_br: o valor é codificado para JSON, se necessário

source: when a virtual thread performs a blocking operation inside a `synchronized` block or method
pt_br: quando uma thread virtual executa uma operação de bloqueio dentro de um bloco ou método `synchronized`

source: when it executes a blocking operation inside a native method or a foreign function
pt_br: quando executa uma operação bloqueante dentro de um método nativo ou de uma função externa

source: xref:grpc-getting-started.adoc[Getting Started]
pt_br: link:grpc-getting-started.html[Iniciando]

source: xref:grpc-kubernetes.adoc[Deploying your gRPC Service in Kubernetes]
pt_br: link:grpc-kubernetes.html[Implantando seu serviço gRPC no Kubernetes]

source: xref:grpc-service-consumption.adoc[Consuming a gRPC Service]
pt_br: link:grpc-service-consumption.html[Consumindo um serviço gRPC]

source: xref:grpc-service-implementation.adoc[Implementing a gRPC Service]
pt_br: link:grpc-service-implementation.html[Implementação de um serviço gRPC]

source: xref:grpc-xds.adoc[Enabling xDS gRPC support]
pt_br: link:grpc-xds.html[Ativação do suporte xDS gRPC]

source: xref:quarkus-runtime-base-image.adoc[This page] explains how to extend the `quarkus-micro` image when your application has specific requirements.
pt_br: link:quarkus-runtime-base-image.html[Esta página] explica como extender a imagem `quarkus-micro` quando a sua aplicação tem requisitos específicos.

source: xref:security-authentication-mechanisms.adoc#combining-authentication-mechanisms[Combining authentication mechanisms]
pt_br: link:security-authentication-mechanisms.html#combining-authentication-mechanisms[Combinando de mecanismos de autenticação]

source: xref:security-authentication-mechanisms.adoc#form-auth[Form-based authentication]
pt_br: link:security-authentication-mechanisms.html#form-auth[Autenticação baseada em formulários]

source: xref:security-authentication-mechanisms.adoc#oidc-jwt-oauth2-comparison[Choosing between OpenID Connect, SmallRye JWT, and OAuth2 authentication mechanisms]
pt_br: link:security-authentication-mechanisms.html#oidc-jwt-oauth2-comparison[Escolhendo entre os mecanismos de autenticação OpenID Connect, SmallRye JWT e OAuth2]

source: xref:security-basic-authentication-tutorial.adoc[Secure a Quarkus application with Basic authentication and Jakarta Persistence]
pt_br: link:security-basic-authentication-tutorial.html[Proteger uma aplicação Quarkus com autenticação básica e Jakarta Persistence]

source: xref:security-basic-authentication.adoc[Basic authentication]
pt_br: xref:security-basic-authentication.adoc[Autenticação básica]

source: xref:security-identity-providers.adoc[Identity Providers]
pt_br: xref:security-identity-providers.adoc[Fornecedores de identidade]

source: xref:security-jdbc.adoc[Using security with JDBC]
pt_br: link:security-jdbc.html[Utilizar o security com JDBC]

source: xref:security-jpa.adoc[Quarkus Security with Jakarta Persistence]
pt_br: link:security-jpa.html[Quarkus Security com Jakarta Persistence]

source: xref:security-ldap.adoc[Using security with an LDAP realm]
pt_br: link:security-ldap.html[Utilizar o security com um domínio LDAP]

source: xref:security-oidc-bearer-token-authentication-tutorial.adoc[Protect a service application by using OpenID Connect (OIDC) Bearer token authentication]
pt_br: link:security-oidc-bearer-token-authentication-tutorial.html[Proteger uma aplicação de serviço usando a autenticação de token Bearer OpenID Connect (OIDC)]

source: xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication]
pt_br: link:security-oidc-bearer-token-authentication.html[Autenticação de Token Bearer OIDC]

source: xref:security-openid-connect-client-reference.adoc[OpenID Connect and OAuth2 Client and Filters Reference Guide]
pt_br: link:security-openid-connect-client-reference.html[Guia de referência para OpenID Connect e OAuth2: Client e Filters]

source: xref:security-overview.adoc[Quarkus Security overview]
pt_br: xref:security-overview.adoc[Visão geral do Quarkus Security]

source: xref:security-overview.adoc[Quarkus Security]
pt_br: link:security-overview.html[Quarkus Security]

source: xref:security-testing.adoc#configuring-user-information[Configuring User Information in application.properties]
pt_br: xref:security-testing.adoc#configuring-user-information[Configurar as informações do usuário no application.properties]

source: you can add a `src/main/resources/META-INF/quarkus-preload-classes.txt` file listing the classes to preload, such as:
pt_br: você pode adicionar um arquivo `src/main/resources/META-INF/quarkus-preload-classes.txt` que enumere as classes que serão pré-carregadas, como por exemplo:

source: you include the `quarkus-test-kubernetes-client` dependency
pt_br: Você inclua a dependência `quarkus-test-kubernetes-client`
